In [1]:
import os
import pymysql
import mysql.connector
import pymongo
from sqlalchemy import create_engine
from sqlalchemy import sql
import json

import pandas as pd
import matplotlib.pyplot as plt

In [2]:
#host_name = "mbz8dg-ds2002"
host_name = "mbz8dg-ds2002.mysql.database.azure.com"
port = "3306"

user_id = "tylermcf"
pwd = "thePassword4"
db_name = "sakila"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

In [3]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"

sqlEngine = create_engine(conn_str, pool_recycle=3600)
conn = sqlEngine.connect()

sql_query = sql.text("""
    SELECT * from category;
""")
#print(sql_query);
df = pd.read_sql(sql_query, conn);
conn.close()
df.head()

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27
3            4   Classics 2006-02-15 04:46:27
4            5     Comedy 2006-02-15 04:46:27

In [4]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    try:
        conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
        sqlEngine = create_engine(conn_str, pool_recycle=3600)
        connection = sqlEngine.connect()
        dframe = pd.read_sql(sql_query, connection);
        connection.close()
    
        return dframe
    except:
        print("could not get dataframe")


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    try:
        conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
        sqlEngine = create_engine(conn_str, pool_recycle=3600)
        connection = sqlEngine.connect()

        if db_operation == "insert":
            df.to_sql(table_name, con=connection, index=False, if_exists='replace')
            connection.execute(sql.text((f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")))
            
        elif db_operation == "update":
            df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
        connection.close()
    except:
        print("could not set dataframe")

In [5]:
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)
with sqlEngine.connect() as conn:
    conn.execute(sql.text(f"DROP DATABASE IF EXISTS `{dst_dbname}`;"))
    conn.execute(sql.text(f"CREATE DATABASE `{dst_dbname}`;"))
    conn.execute(sql.text(f"USE {dst_dbname};"))
conn.close()

In [6]:
atlas_cluster_name = "cluster0"
atlas_user_name = "mbz8dg"
atlas_password = "thePassword4"

mongo_conn_str = {
 #   "atlas" : f"mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/"
   "atlas": f"mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/"
}
client = pymongo.MongoClient(mongo_conn_str["atlas"])
print(f"Atlas Connection String: {mongo_conn_str['atlas']}")

Atlas Connection String: mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/

In [7]:
def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str,tlsAllowInvalidCertificates=True,ssl=True)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    try:
        db = client[db_name]
        dframe = pd.DataFrame(list(db[collection].find(query)))
        dframe.drop(['_id'], axis=1, inplace=True)
        client.close()
        return dframe
    except:
        print("could not get mongo dataframe")

# dimensions: customer, staff, date

In [8]:
print(mongo_conn_str['atlas'])
query = {}
df_customer = get_mongo_dataframe(mongo_conn_str['atlas'], 'sakila', 'customer', query)
df_customer.head(2)
drop_cols = ['store_id','address_id',"active"]
df_customer.drop(drop_cols, axis=1,inplace=True)
df_customer.rename(columns={"customer_id":"customer_key"}, inplace= True)
df_customer.head(2)

mongodb+srv://mbz8dg:thePassword4@cluster0.hkyzauy.mongodb.net/

,customer_key,first_name,last_name,email,create_date,last_update
0,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2006-02-14 22:04:36,2006-02-15 04:57:20
1,18,CAROL,GARCIA,CAROL.GARCIA@sakilacustomer.org,2006-02-14 22:04:36,2006-02-15 04:57:20

In [9]:
data_dir = os.path.join(os.getcwd(), 'downloads','sakila-db')
data_file = os.path.join(data_dir, 'Staff.csv')
df_staff = pd.read_csv(data_file, header=0, index_col=False)

df_staff.drop(['picture','address_id','store_id','active'],axis=1,inplace=True)
df_staff.rename(columns={'staff_id':"staff_key"},inplace=True)
df_staff.head()

,staff_key,first_name,last_name,email,username,password,last_update
0,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,Mike,8cb2237d0679ca88db6464eac60da96345513964,2/15/06 3:57
1,2,Jon,Stephens,Jon.Stephens@sakilastaff.com,Jon,NaN,2/15/06 3:57

In [12]:
sql_date = sql.text("SELECT * FROM sakila.dim_date;")
df_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_date)
df_date.head(2)
drop_cols = ['date_key','date_name_us','date_name_eu','date_name']
df_date.drop(drop_cols,axis=1,inplace=True)
df_date.full_date = df_date.full_date.astype('datetime64')
df_date.rename(columns={'full_date':"date_key"},inplace=True)
df_date.head(2)
print(df_date.dtypes)

date_key                datetime64[ns]
day_of_week                      int64
day_name_of_week                object
day_of_month                     int64
day_of_year                      int64
weekday_weekend                 object
week_of_year                     int64
month_name                      object
month_of_year                    int64
is_last_day_of_month            object
calendar_quarter                 int64
calendar_year                    int64
calendar_year_month             object
calendar_year_qtr               object
fiscal_month_of_year             int64
fiscal_quarter                   int64
fiscal_year                      int64
fiscal_year_month               object
fiscal_year_qtr                 object
dtype: object

In [ ]:
db_operation = "insert"

tables = [('dim_customer', df_customer, sql.text('customer_key')),
          ('dim_staff', df_staff, 'staff_key'),
          ('dim_date', df_date, 'date_key')]

In [ ]:
set_dataframe(user_id, pwd, host_name, dst_dbname, df_staff, "dim_staff", 'staff_key', "insert")
set_dataframe(user_id, pwd, host_name, dst_dbname, df_customer, "dim_customer", 'customer_key', db_operation)
set_dataframe(user_id, pwd, host_name, dst_dbname, df_date, "dim_date", 'date_key', db_operation)

In [ ]:
sql_test = sql.text("""


select * from sakila_dw.dim_staff

""")

df_test1 = get_dataframe(user_id,pwd,host_name,'sakila_dw',sql_test)
df_test1.head()

In [ ]:
sql_test = sql.text("""


select * from sakila_dw.dim_customer

""")

df_test2 = get_dataframe(user_id,pwd,host_name,'sakila_dw',sql_test)
df_test2.head()

In [ ]:
sql_test = sql.text("""


select * from sakila_dw.dim_date

""")

df_test3 = get_dataframe(user_id,pwd,host_name,'sakila_dw',sql_test)
df_test3.head()

# fact table: payments + rentals

In [ ]:
sql_rental = sql.text(" Select * from sakila.rental;")
df_rental = get_dataframe(user_id, pwd, host_name, src_dbname, sql_rental)
df_rental.drop(['last_update'],axis=1,inplace=True)
df_rental.head(2)
print(df_rental.dtypes)

In [ ]:
sql_payment = sql.text(" Select * from sakila.payment;")
df_payment = get_dataframe(user_id, pwd, host_name, src_dbname, sql_payment)
df_payment.drop(['customer_id','staff_id','last_update',],axis=1,inplace=True)
df_payment.head(2)

In [ ]:
fact_rental = pd.merge(df_rental, df_payment, on = 'rental_id', how= 'left')
fact_rental.rename(columns={"rental_id":"fact_rental_key","customer_id":"customer_key","staff_id":"staff_key","rental_date":"rental_key","return_date":"return_key","payment_date":"payment_key"}, inplace = True)
fact_rental.drop(['payment_id','inventory_id'], axis=1, inplace = True)
fact_rental.head(2)

In [ ]:
ordered_columns = ['fact_rental_key','customer_key','staff_key','rental_key','return_key','amount','payment_key']
fact_rental = fact_rental[ordered_columns]
fact_rental.head(2)

In [ ]:
set_dataframe(user_id, pwd, host_name, dst_dbname, fact_rental, "fact_rental", 'fact_rental_key', "insert")

In [ ]:
sql_test = sql.text("""


Select staff.last_name AS 'staff_name',
	count(rentals.rental_key) as 'days',
	sum(rentals.amount) as 'total_sales'
from sakila_dw.fact_rental as rentals
inner join sakila_dw.dim_staff as staff
on rentals.staff_key = staff.staff_key
group by staff.last_name

""")

df_test = get_dataframe(user_id,pwd,host_name,'sakila_dw',sql_test)
df_test.head()